research/vita.org
#+TITLE: 
#+AUTHOR:
#+OPTIONS: toc:nil num:nil
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [article,10pt]
#+LATEX_HEADER: \usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}
#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \pagestyle{fancyplain}
#+LATEX_HEADER: \lfoot{Last updated \today} \cfoot{} \rfoot{\thepage}

* Thomas J. Faulkenberry, Ph.D.

Department of Psychological Sciences\\  
Tarleton State University\\
Box T-0820, Stephenville, TX 76402\\  
Phone: +1 (254) 968-9816\\  
Email: faulkenberry@tarleton.edu\\
Website: [[http://tomfaulkenberry.github.io]]

** Education   
- Ph.D., Psychology, Texas A&M University – Commerce, 2010
- M.S., Mathematics, Oklahoma State University - 2002
- B.S. with highest honors, Mathematics, Southeastern Oklahoma State University, 2000

** Academic positions
- 2019-present: Associate Professor (with tenure), Department of Psychological Sciences, Tarleton State University
- 2013-2019: Assistant Professor, Department of Psychological Sciences, Tarleton State University
- 2012-2013: Assistant Professor, Department of Mathematics, Texas A&M University – Commerce
- 2010-2012: Visiting Assistant Professor, Department of Psychology and Special Education, Texas A&M University – Commerce
- 2005-2010: Lecturer, Department of Mathematics, Texas A&M University - Commerce

** Honors and awards
- O. A. Grant Excellence in Teaching Award, Tarleton State University College of Education, 2018
- Faculty Excellence in Scholarship Award, Tarleton State University College of Education, 2016
- President's All-Purple Award, Tarleton State University, 2016
- Nominee, Bruce N. Chaloux Award for Early Career Excellence in Online Education, Sloan Consortium, 2015
- Fellow, The Psychonomic Society, 2014
- Texas A&M University System Teaching Excellence Award, 2010-2011
- Best Graduate Student Presentation, Annual Research Symposium, TAMU-C, 2010
- O.H. Hamilton Fellowship in Mathematics, Oklahoma State University, 2002
- S. J. Scroggs Distinguished Graduate Fellowship, Oklahoma State University, 2001
- Regional University Scholarship (4 years), Southeastern Oklahoma State University, 1996
  
** Administrative activities
- 2019-present: Assistant Head, Department of Psychological Sciences, Tarleton State University
- 2011-2012: Director, Center for Undergraduate Research and Creative Activities, TAMU-C
- 2010-2011: Director, Math & Science Teacher Preparation Program (LeoTEACH), TAMU-C

