research/vita.tex
% Created 2020-04-26 Sun 07:56
% Intended LaTeX compiler: pdflatex
\documentclass[article,10pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}
\usepackage{fancyhdr}
\pagestyle{fancyplain}
\lfoot{Last updated \today} \cfoot{} \rfoot{\thepage}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}


\section*{Thomas J. Faulkenberry, Ph.D.}
\label{sec:org19f3ec8}

Department of Psychological Sciences\\
Tarleton State University\\
Box T-0820, Stephenville, TX 76402\\
Phone: +1 (254) 968-9816\\
Email: faulkenberry@tarleton.edu\\
Website: \url{http://tomfaulkenberry.github.io}

\subsection*{Education}
\label{sec:orgd8fe830}
\begin{itemize}
\item Ph.D., Psychology, Texas A\&M University – Commerce, 2010
\item M.S., Mathematics, Oklahoma State University - 2002
\item B.S. with highest honors, Mathematics, Southeastern Oklahoma State University, 2000
\end{itemize}

\subsection*{Academic positions}
\label{sec:org599ee98}
\begin{itemize}
\item 2019-present: Associate Professor (with tenure), Department of Psychological Sciences, Tarleton State University
\item 2013-2019: Assistant Professor, Department of Psychological Sciences, Tarleton State University
\item 2012-2013: Assistant Professor, Department of Mathematics, Texas A\&M University – Commerce
\item 2010-2012: Visiting Assistant Professor, Department of Psychology and Special Education, Texas A\&M University – Commerce
\item 2005-2010: Lecturer, Department of Mathematics, Texas A\&M University - Commerce
\end{itemize}

\subsection*{Honors and awards}
\label{sec:org2e28143}
\begin{itemize}
\item O. A. Grant Excellence in Teaching Award, Tarleton State University College of Education, 2018
\item Faculty Excellence in Scholarship Award, Tarleton State University College of Education, 2016
\item President's All-Purple Award, Tarleton State University, 2016
\item Nominee, Bruce N. Chaloux Award for Early Career Excellence in Online Education, Sloan Consortium, 2015
\item Fellow, The Psychonomic Society, 2014
\item Texas A\&M University System Teaching Excellence Award, 2010-2011
\item Best Graduate Student Presentation, Annual Research Symposium, TAMU-C, 2010
\item O.H. Hamilton Fellowship in Mathematics, Oklahoma State University, 2002
\item S. J. Scroggs Distinguished Graduate Fellowship, Oklahoma State University, 2001
\item Regional University Scholarship (4 years), Southeastern Oklahoma State University, 1996
\end{itemize}

\subsection*{Administrative activities}
\label{sec:orgb71c7ac}
\begin{itemize}
\item 2019-present: Assistant Head, Department of Psychological Sciences, Tarleton State University
\item 2011-2012: Director, Center for Undergraduate Research and Creative Activities, TAMU-C
\item 2010-2011: Director, Math \& Science Teacher Preparation Program (LeoTEACH), TAMU-C
\end{itemize}
