research/vita.tex

\subsection*{Research publications}
\label{sec:org64d9741}
\begin{enumerate}
\item Faulkenberry, T. J. (in press). Estimating Bayes factors from minimal ANOVA summaries for repeated-measures designs. To appear in \emph{Metodoloski Zvezki: Advances in Methodology and Statistics}. \url{https://arxiv.org/abs/1905.05569}
\item Nejman, J. A. \& Faulkenberry, T. J. (in press). Implicit priming reveals decomposed processing in fraction comparison. To appear in \emph{Journal of Psychological Inquiry}. \url{https://psyarxiv.com/nkw45/}
\item Faulkenberry, T. J., Cruise, A., \& Shaki, S. (2020). Task instructions modulate unit-decade binding in two-digit number representation. \emph{Psychological Research}, \emph{84}, 424-439. doi: \href{https://dx.doi.org/10.1007/s00426-018-1057-9}{10.1007/s00426-018-1057-9}
\item Faulkenberry, T. J. (2019). Estimating evidential value from ANOVA summaries: A comment on Ly et al. (2018). \emph{Advances in Methods and Practices in Psychological Science}, \emph{2}, 406-409. doi: \href{https://doi.org/10.1177/2515245919872960}{10.1177/2515245919872960}
\item Faulkenberry, T. J. (2019). A tutorial on generalizing the default Bayesian t-test via posterior sampling and encompassing priors. \emph{Communications for Statistical Applications and Methods}, \emph{26}, 217-238. doi: \href{https://doi.org/10.29220/CSAM.2019.26.2.217}{10.29220/CSAM.2019.26.2.217}
\item Frampton, A. R., \& Faulkenberry, T. J. (2018). Mental arithmetic processes: Testing the independence of encoding and calculation. \emph{Journal of Psychological Inquiry}, \emph{22}, 30-35. \url{https://www.psychinquiry.org/wp-content/uploads/2019/03/Vol22-1.pdf}
\item Faulkenberry, T. J., Vick, A. D., \& Bowman, K. A. (2018). A shifted Wald decomposition of the numerical size-congruity effect: Support for a late interaction account. \emph{Polish Psychological Bulletin}, \emph{49}, 391-397. doi: \href{http://dx.doi.org/10.24425/119507}{10.24425/119507}
\item Faulkenberry, T. J., Witte, M., \& Hartmann, M. (2018). Tracking the continuous dynamics of numerical processing: A brief review and editorial. \emph{Journal of Numerical Cognition}, /4/(2), 271-285. doi: \href{http://dx.doi.org/10.5964/jnc.v4i2.179}{10.5964/jnc.v4i2.179}
\item Faulkenberry, T. J. (2018). Computing Bayes factors to measure evidence from experiments: An extension of the BIC approximation. \emph{Biometrical Letters}, /55/(1), 31-43. doi: \href{https://doi.org/10.2478/bile-2018-0003}{10.2478/bile-2018-0003}
\item Faulkenberry, T. J. (2018). A simple method for teaching Bayesian hypothesis testing in the brain and behavioral sciences. \emph{Journal of Undergraduate Neuroscience Education}, \emph{16}, A126-A130. \url{http://www.funjournal.org/wp-content/uploads/2018/01/june-16-126.pdf?x91298}
\item Faulkenberry, T. J. (2017). A single-boundary accumulator model of response times in an arithmetic verification task. \emph{Frontiers in Psychology}, \emph{8:1225}. doi: \href{http://dx.doi.org/10.3389/fpsyg.2017.01225}{10.3389/fpsyg.2017.01225/}
\item Faulkenberry, T. J., Cruise, A., \& Shaki, S. (2017). Reversing the manual digit bias in two-digit number comparison. \emph{Experimental Psychology}, \emph{64}, 191-204.  doi: \href{http://dx.doi.org/10.1027/1618-3169/a000365}{10.1027/1618-3169/a000365}
\item Sobel, K. V., Puri, A. M., Faulkenberry, T. J., \& Dague, T. D. (2017). Visual search for conjunctions of physical and numerical size shows that they are processed independently. \emph{Journal of Experimental Psychology: Human Perception \& Performance}, \emph{43}, 444-453. doi: \href{http://dx.doi.org/10.1037/xhp0000323}{10.1037/xhp0000323}
\item Faulkenberry, T. J., \& Tummolini, L. (2016). Commentary: Is there any Influence of Variations in Context on Object-Affordance Effects in Schizophrenia? Perception of Property and Goals of Action). \emph{Frontiers in Psychology}, \emph{7:1915}. doi: \href{http://dx.doi.org/10.3389/fpsyg.2016.01915}{10.3389/fpsyg.2016.01915}
\item Faulkenberry, T. J. (2016). Testing a direct mapping versus competition account of response dynamics in number comparison. \emph{Journal of Cognitive Psychology}, \emph{28}, 825-842. doi: \href{http://dx.doi.org/10.1080/20445911.2016.1191504}{10.1080/20445911.2016.1191504}
\item Sobel, K. V., Puri, A. M., \& Faulkenberry, T. J. (2016). Bottom-up and top-down attentional contributions to the size-congruity effect. \emph{Attention, Perception, \& Psychophysics}, \emph{78}, 1324-1336. doi: \href{http://dx.doi.org/10.3758/s13414-016-1098-3}{10.3758/s13414-016-1098-3}
\item Faulkenberry, T. J., Cruise, A., Lavro, D., \& Shaki, S. (2016). Response trajectories capture the continuous dynamics of the size congruity effect. \emph{Acta Psychologica}, \emph{163}, 114-123. doi: \href{http://dx.doi.org/10.1016/j.actpsy.2015.11.010}{10.1016/j.actpsy.2015.11.010}
\item Faulkenberry, T. J., Montgomery, S. A., \& Tennes, S. N. (2015). Response trajectories reveal the temporal dynamics of fraction representations. \emph{Acta Psychologica}, \emph{159}, 100-107. doi: \href{http://dx.doi.org/10.1016/j.actpsy.2015.05.013}{10.1016/j.actpsy.2015.05.013}
\item Faulkenberry, T. J., \& Rey, A. R. (2014). Extending the reach of mousetracking in numerical cognition: A comment on Fischer and Hartmann (2014). \emph{Frontiers in Psychology}, \emph{5}:1436. doi: \href{http://dx.doi.org/10.3389/fpsyg.2014.01436}{10.3389/fpsyg.2014.01436}
\item Faulkenberry, T. J. (2014). Hand movements reflect competitive processing in numerical cognition. \emph{Canadian Journal of Experimental Psychology}, \emph{68}, 147-151. doi: \href{http://dx.doi.org/10.1037/cep0000021}{10.1037/cep0000021}
\item Faulkenberry, T. J., \& Geye, T. L. (2014). The cognitive origins of mathematics learning disability: A review. \emph{The Rehabilitation Professional}, \emph{22} (1), 9-16.
\item Faulkenberry, T. J., \& Faulkenberry, E. D. (2013). Teaching integer arithmetic without rules: An embodied approach. \emph{Oklahoma Journal of School Mathematics}, \emph{5} (2), 5-14.
\item Faulkenberry, T. J., (2013). The conceptual/procedural distinction belongs to strategies, not tasks: A comment on Gabriel et al. (2013). \emph{Frontiers in Psychology}, \emph{4}:820. doi: \href{http://dx.doi.org/10.3389/fpsyg.2013.00820}{10.3389/fpsyg.2013.00820}
\item Faulkenberry, T. J., \& Montgomery, S. A. (2013). The primacy of fraction components in adults’ numerical judgements. In Reeder, S. L. and Matney, G. T. (Eds.). \emph{Proceedings of the 40th Annual Meeting of the Research Council on Mathematics Learning} (pp. 155-162). Tulsa, OK: RCML
\item Faulkenberry, T. J. (2013). How the hand mirrors the mind: The embodiment of numerical cognition. In Reeder, S. L. and Matney, G. T. (Eds.). \emph{Proceedings of the 40th Annual Meeting of the Research Council on Mathematics Learning} (pp. 205-212). Tulsa, OK: RCML
\item Faulkenberry, E. D., \& Faulkenberry, T. J. (2012). Do you see what I see? An exploration of self-perception in the classroom. In S. L. Reeder (Ed.), \emph{Proceedings of the 39th Annual Meeting of the Research Council on Mathematics Learning} (pp. 121-126). Charlotte, NC: RCML.
\item Faulkenberry, T. J., \& Pierce, B. H. (2011). Mental representations in fraction comparison: Holistic versus component-based strategies. \emph{Experimental Psychology}, \emph{58}, 480-489. doi: \href{http://dx.doi.org/10.1027/1618-3169/a000116}{10.1027/1618-3169/a000116}
\item Faulkenberry, T. J. (2011). Individual differences in mental representations of fraction magnitude. In S. Reeder (Ed.) \emph{Proceedings of the 38th Annual Meeting of the Research Council on Mathematics Learning} (pp. 136-143). Cincinnati, OH: RCML.
\item Faulkenberry, E. D., \& Faulkenberry, T. J. (2010). Transforming the way we teach function transformations. \emph{Mathematics Teacher}, \emph{104}, 29-33.
\item Faulkenberry, T. J. (2010). The working memory demands of simple fraction strate- gies. In S. Reeder (Ed.) \emph{Proceedings of the 37th Annual Meeting of the Research Council on Mathematics Learning} (pp. 84-89). Conway, AR: RCML.
\item Faulkenberry, E. D. \& Faulkenberry, T. J. (2006). Constructivism in mathematics education: A historical and personal perspective. \emph{The Texas Science Teacher}, \emph{35}, 17- 22.
\end{enumerate}
