research/vita.tex

\subsection*{Abstracts, columns, and book reviews}
\label{sec:orgf694e7f}
\begin{enumerate}
\item Faulkenberry, T. J. (2019). Book review of "Handbook of Approximate Bayesian Computation". \emph{MAA Reviews}, \url{https://www.maa.org/press/maa-reviews/handbook-of-approximate-bayesian-computation}.
\item Bowman, K. A., \& Faulkenberry, T. J. (2019). Response time modeling supports a late interaction account of the size-congruity effect. \emph{Abstracts of the Psychonomic Society}, \emph{24}, 227-228.
\item Faulkenberry, T. J. (2019). Treasurer's Column: Financial Challenges in Albuquerque. \emph{Southwestern Psychologist}, \emph{12(2)}, 3.
\item Faulkenberry, T. J. (2018). Modeling individual difference structures in the size-congruity effect. \emph{Abstracts of the Psychonomic Society}, \emph{23}, 42.
\item Bowman, K. A., \& Faulkenberry, T. J. (2018). Nonwords induce reverse priming effects in a lexical decision task. \emph{Abstracts of the Psychonomic Society}, \emph{23}, 246.
\item Faulkenberry, T. J. (2018). Treasurer's Column: Where does the money go? A quick picture of SWPA finances. \emph{Southwestern Psychologist}, \emph{11(1)}, 3.
\item Faulkenberry, T. J. (2017). A single-boundary accumulator model of decisions in a mental arithmetic task. \emph{Abstracts of the Psychonomic Society}, \emph{22}, 27.
\item Geye, T. L., \& Faulkenberry, T. J. (2017). Computer mousetracking reveals the facilitation and interference components of the size congruity effect. \emph{Abstracts of the Psychonomic Society}, \emph{22}, 106.
\item Bowman, K. A., \& Faulkenberry, T. J. (2017). The dynamics of spatial-operational momentum in mental arithmetic. \emph{Abstracts of the Psychonomic Society}, \emph{22}, 188.
\item Faulkenberry, T. J. (2017). Treasurer's Column: Standing on the shoulders of giants. \emph{Southwestern Psychologist}, \emph{10(2)}, 5.
\item Faulkenberry, T. J. (2016). Motor dynamics support a competition model of number processing. \emph{Abstracts of the Psychonomic Society}, \emph{21}, 26.
\item Bowman, K. A., \& Faulkenberry, T. J. (2016). Testing competing models of two-digit number representation: Decomposed versus holistic processing. \emph{Abstracts of the Psychonomic Society}, \emph{21}, 285.
\item Faulkenberry, T. J. (2016). Decoding the development of mathematical thinking: A book review of \emph{Development of Mathematical Thinking: Neural Substrates and Genetic Influences}. \emph{PsycCRITIQUES}, \emph{61} (31). doi: \href{http://dx.doi.org/10.1037/a0040434}{10.1037/a0040434}
\item Faulkenberry, T. J. (2016). Undergraduate students: An endangered resource? \emph{Southwestern Psychologist}, \emph{9(1)}, 2.
\item Faulkenberry, T. J., Cruise, A., Lavro, D., \& Shaki, S. (2015). Response trajectories support a late-interaction model of the size-congruity effect. \emph{Canadian Journal of Experimental Psychology, 69}, 346.
\item Faulkenberry, T. J., Cruise, A., \& Shaki, S. (2015). Reversing the manual decade bias in two-digit number comparison. \emph{Abstracts of the Psychonomic Society, 20}, 39.
\item Geye, T. L, \& Faulkenberry, T. J. (2015). Response trajectories capture individual differences in a size congruity task. \emph{Abstracts of the Psychonomic Society, 20}, 249.
\item Faulkenberry, T. J., Cruise, A., Lavro, D., \& Shaki, S. (2014). Response trajectories capture the continuous dynamics of the size-congruity effect. \emph{Abstracts of the Psychonomic Society, 19}, 53.
\item Faulkenberry, T. J. (2013). Measuring the working memory requirements of mental arithmetic. \emph{Canadian Journal of Experimental Psychology, 67}, 281.
\item Faulkenberry, T. J. (2013). Measuring the working memory requirements of mental arithmetic. \emph{Abstracts of the Psychonomic Society, 18}, 203-204.
\item Faulkenberry, T. J. (2012). The temporal dynamics of fraction representations: Components are processed first. \emph{Canadian Journal of Experimental Psychology, 66}, 310.
\item Faulkenberry, T. J. \& Montgomery, S. A. (2012). The primacy of components in numerical fractions. \emph{Abstracts of the Psychonomic Society, 17}, 206.
\item Faulkenberry, T. J. (2011). Brain-based mathematics: Promising practice or hopeful hype? \emph{RCML Intersection Points, 35} (3), 9-10.
\item Faulkenberry, T. J. \& Kelsey, A. R. (2011). Working memory and strategic performance in fraction comparison. \emph{Canadian Journal of Experimental Psychology, 65}, 311-311.
\item Faulkenberry, T. J. (2011). The dynamics of the SNARC effect: Evidence from mouse tracking. \emph{Canadian Journal of Experimental Psychology, 65}, 316-316.
\item Faulkenberry, T. J. (2011). Motor dynamics in numerical representations: Evidence from mouse tracking. \emph{Abstracts of the Psychonomic Society, 16}, 76-76.
\item Faulkenberry, T. J. (2010). The roles of phonological and visuo-spatial working memory resources in simple fraction strategies. \emph{Canadian Journal of Experimental Psychology, 64}, 302-302.
\item Lu, S. Wakefield, L. \& Faulkenberry, T. J. (2006). The roles of beginnings, overlap, and ends in event temporal relations. \emph{Abstracts of the Psychonomic Society, 11}, 9-9.
\end{enumerate}
