research/vita.tex

\subsection*{Conference Presentations}
\label{sec:org7bef56c}
\begin{enumerate}
\item Faulkenberry, T. J. (June, 2019). A hierarchical Bayesian model of individual difference structures for the size-congruity effect. Math Cognition and Learning Society, Ottawa, ON.
\item Faulkenberry, T. J., Hetzel, S., \& Bowman, K. (April, 2019). A systems factorial technology approach to classifying the architecture of fraction perception. Southwestern Psychological Association, Albuquerque, NM.
\item Faulkenberry, T. J. (April, 2019). An introduction to the theory and practice of Bayesian hypothesis testing: A workshop using JASP. Southwestern Psychological Association, Albuquerque, NM.
\item Bowman, K., \& Faulkenberry, T. J. (April, 2019). Response time modeling supports a late interaction account of the size-congruity effect. Southwestern Psychological Association, Albuquerque, NM.
\item Faulkenberry, T. J. (January, 2019). Demonstrating Bayesian model comparison with a class-sourced experiment in mental arithmetic. National Institute on the Teaching of Psychology (NITOP), St. Pete Beach, FL
\item Faulkenberry, T. J. (April, 2018). Introduction to Bayesian inference for the psychological sciences (workshop). Southwestern Psychological Association, Houston, TX
\item Bowman, K. A., \& Faulkenberry, T. J. (April, 2018). The dynamics of spatial operational momentum in mental arithmetic. Southwestern Psychological Association, Houston, TX.
\item Faulkenberry, T. J. (November, 2017). A hierarchical Bayesian model for measuring response times in a mental arithmetic task. Society for Mathematical Psychology, Vancouver, BC.
\item Faulkenberry, T. J. (April, 2017). Accumulator models of decision processes in mental arithmetic. Southwestern Psychological Association, San Antonio, TX
\item Faulkenberry, T. J., \& Wood, J. (April, 2017). A Bayesian perspective on the operator preview paradigm in mental arithmetic. Southwestern Psychological Association, San Antonio, TX
\item Nejman, J., \& Faulkenberry, T. J. (April, 2017). Implicit priming reveals both holistic and decomposed processing in fraction comparison. Southwestern Psychological Association, San Antonio, TX
\item Wood, J., \& Faulkenberry, T. J. (April, 2017). The dynamics of operator preview effects in mental arithmetic. Southwestern Psychological Association, San Antonio, TX
\item Bowman, K., \& Faulkenberry, T. J. (April, 2017). Testing competing models of two-digit number representation: Decomposed versus holistic processing. Southwestern Psychological Association, San Antonio, TX
\item Faulkenberry, T. J. (April, 2016). Testing two accounts of response dynamics in a number comparison task. Southwestern Psychological Association, Dallas, TX
\item Faulkenberry, T. J. (April, 2016). Recent developments on the size congruity effect in numerical cognition. Southwestern Psychological Association, Dallas, TX
\item Rutledge, M., \& Faulkenberry, T. J. (April, 2016). Spatial-numerical associations in mental arithmetic. Southwestern Psychological Association, Dallas, TX
\item Geye, T., \& Faulkenberry, T. J. (April, 2016). Computer mousetracking reveals individual differences in a size congruity task. Southwestern Psychological Association, Dallas, TX
\item Bowman, K. A., \& Faulkenberry, T. J. (April, 2016). The effects of mathematical fluency on multi-digit number representations. Southwestern Psychological Association, Dallas, TX
\item Faulkenberry, T. J. (October, 2015). Testing a direct-mapping versus competition account of response dynamics in a number comparison task. ARMADILLO 2015, Waco, TX.
\item Bowman, K. A., \& Faulkenberry, T. J. (October, 2015). The effects of mathematical fluency on multi-digit number representations. ARMADILLO 2015, Waco, TX.
\item Bowman, K. A., \& Faulkenberry, T. J. (October, 2015). The effects of mathematical fluency on multi-digit number representations. TAMUS Pathways Symposium, Corpus Christi, TX.
\item Bowman, K. A., \& Faulkenberry, T. J. (October, 2015). The effects of mathematical fluency on multi-digit number representations. Tarleton Research Symposium, Stephenville, TX.
\item Faulkenberry, T. J. (April, 2015). Class-sourcing replications of reaction time studies: An example in mathematical cognition. Southwestern Teachers of Psychology Conference, Wichita, KS.
\item Geye, T., Fleming, B., \& Faulkenberry, T. J. (April, 2015). Validation of the calculation fluency test for measuring arithmetic skills. Southwestern Psychological Association, Wichita, KS.
\item Frampton, A., \& Faulkenberry, T. J. (April, 2015). Cognitive arithmetic processs: The effects of problem size and format on performance. Southwestern Psychological Association, Wichita, KS.
\item Faulkenberry, T. J. (April, 2015). Evidence for a late-interactions model of the numerical size congruity effect. Southwestern Psychological Association, Wichita, KS.
\item Harris Bozer, A., \& Faulkenberry, T. J. (April, 2015). Applying the CREATE pedagogical tool to the online animal behavior course to enhance scientific literacy.  2015 CIRTL Forum: Preparing the Future STEM Faculty for the Rapidly Changing Landscape of Higher Education, College Station, TX.
\item Frampton, A., \& Faulkenberry, T. J. (March, 2015). Cognitive arithmetic processes: The effects of numerical surface form on strategy choice. Texas Undergraduate Research Day at the Capitol, Austin, TX.
\item Faulkenberry, E. D., Smith, K., Riggs, E., \& Faulkenberry, T. J. (February, 2015). The evolution of PST’s beliefs: Examining the effect of teacher preparation. Research Council on Mathematics Learning, Las Vegas, NV.
\item Faulkenberry, T. J. (October, 2014).  Hand movements reflect competitive processing in a numerical parity task. ARMADILLO 2014, Norman, OK.
\item Faulkenberry, T. J. (October, 2014). The dynamics of fraction representations: Components are processed first. ARMADILLO 2014, Norman, OK.
\item Faulkenberry, T. J. (April, 2014). Hand movements reflect competitive processing in numerical fraction representations. Southwestern Psychological Association, San Antonio, TX.
\item Faulkenberry, T. J. (April, 2014). A brief introduction to using R for teaching statistical methods. Southwestern Teachers of Psychology Conference, San Antonio, TX.
\item Faulkenberry, T. J. (March, 2014). A classroom activity for demonstrating confirmation bias. Tarleton Excellence in Teaching Conference, Stephenville, TX.
\item Smith, K. H., Riggs, B., Faulkenberry, E. D., \& Faulkenberry, T. J. (February, 2014). A snapshot of preservice teacher beliefs: A factor analytic method. Research Council on Mathematics Learning, San Antonio, TX.
\item Faulkenberry, T. J. (April, 2013). Modeling the roles of working memory and strategy type in fraction comparison. TX Section MAA Meeting, Texas Tech University, Lubbock, TX.
\item Faulkenberry, T. J. (March, 2013). Estimating the working memory requirements of mental arithmetic. OK-AR Section MAA Meeting, Oklahoma State University, Stillwater, OK.
\item Faulkenberry, T. J. (April, 2012). Some limitations in measuring working memory capacity. TX Section MAA Meeting, El Centro College, Dallas, TX.
\item Faulkenberry, T. J. (February, 2012). Examining the role of testing in learning mathematics: Directions for future research. 39th Annual Meeting of the Research Council on Mathematics Learning, Charlotte, NC.
\item Faulkenberry, T. J. \& Pierce, B. H. (October, 2011). The roles of working memory and strategy type in fraction comparison. ARMADILLO 2011, Commerce, TX.
\item Faulkenberry, T. J. (April, 2010). Working memory and strategy execution in simple fraction strategies. Annual Research Symposium, Texas A\& M University - Commerce.
\item Faulkenberry, T. J. (April, 2009). Mathematics anxiety among elementary education majors: Does test format matter?. Annual Research Symposium, Texas A\& M University - Commerce.
\item Faulkenberry, T. J. (February, 2009). Mathematics anxiety among elementary education majors. 36th Annual Meeting of the Research Council on Mathematics Learning, Rome, GA.
\item Faulkenberry, E. D. \& Faulkenberry, T. J. (February, 2008). An assessment of the mathematical knowledge of elementary preservice teachers with regard to number and operation. 35th Annual Meeting of the Research Council on Mathematics Learning, Oklahoma City, OK.
\item Faulkenberry, T. J. (February, 2008). Working memory: Cognitive and instructional implications for mathematics. 35th Annual Meeting of the Research Council on Mathematics Learning, Oklahoma City, OK.
\item Faulkenberry, E. D. \& Faulkenberry, T. J. (October, 2005). Using the geometry module in Teacher Quality grants. Charles A. Dana Center Higher Education Mathematics Conference, Austin, TX.
\item Faulkenberry, T. J. (April, 2005). Cognitive frameworks in advanced mathematical thinking. MAA Texas Section Meeting, University of Texas - Arlington.
\item Faulkenberry, T. J. (April, 2004). The shapes of 2-dimensional manifolds. MAA Texas Section Meeting, Texas A\&M University - Corpus Christi.
\item Faulkenberry, T. J. (March, 2003). Conway’s ZIP proof. MAA Oklahoma/Arkansas Section Meeting, University of Tulsa.
\item Faulkenberry, T. J. (March, 2002). Knot algorithms and their computational complexity. MAA Oklahoma/Arkansas Section Meeting, Henderson State University.
\item Faulkenberry, T. J. (March, 2002). Topology in the high school? National Council of Teachers of Mathematics Regional Conference, Oklahoma City, OK.
\item Faulkenberry, T. J. (March, 1999). The construction of a Riemann surface structure on a once-punctured torus. MAA Oklahoma/Arkansas Section Meeting, Arkansas Tech University.
\item Faulkenberry, T. J. (March, 1998). The classification of Markoff numbers on a once-punctured torus. MAA Oklahoma/Arkansas Section Meeting, Southern Nazarene University.
\end{enumerate}
