research/vita.tex

\subsection*{Seminars and Invited Talks}
\label{sec:orgbd5ac51}
\begin{enumerate}
\item Faulkenberry, T. J. (September 2019). Workshop: Bayesian statistics with JASP -- Angelo State University, San Angelo, TX.
\item Faulkenberry, T. J. (June 2019). Workshop: Bayesian statistics in numerical cognition. Math Cognition and Learning Society, Ottawa, ON.
\item Faulkenberry, T. J. (August, 2018). Workshop on R and Bayesian Statistics -- Texas Lutheran University, Seguin, TX.
\item Faulkenberry, T. J. (April, 2018). Introduction to applied Bayesian hypothesis testing -- Faculty Research Coffee Hour, Stephenville, TX.
\item Faulkenberry, T. J. (December, 2017). Mental representations of two-digit numbers. Texas A\&M University - San Antonio Speakers' Series, San Antonio, TX.
\item Faulkenberry, T. J. (September, 2017). Modeling response times in mental arithmetic. Baylor University Psychology and Neuroscience Speaker Series, Waco, TX.
\item Faulkenberry, T. J. (April, 2017). The Pope, Bayes' Theorem, and Harry Potter: A statistical drama in three acts.  Tarleton Psychology Club, Stephenville, TX.
\item Faulkenberry, T. J. (March, 2017). Using mathematical modeling to understand mental arithmetic. Tarleton Math Club, Stephenville, TX.
\item Faulkenberry, T. J. (Nov. 2015). Associations between number and space in mental arithmetic.  Psychological Sciences Open House, Stephenville, TX.
\item Faulkenberry, T. J. et al. (Oct. 2015). Publishing in the digital age.  CII Panel Presentation, Stephenville, TX.
\item Faulkenberry, T. J. (June, 2015). Discussion of Marghetis et al. (2014). Carleton Math Cognition Lab, Ottawa, Ontario.
\item Smith, K. H., Riggs, B., Faulkenberry, E. D., \& Faulkenberry, T. J. (May, 2014). A snapshot of preservice teacher beliefs: A factor analytic method. Tarleton State University Math Day 2014.
\item Faulkenberry, T. J. (Feb, 2014). Detecting cognitive processes via the motions of the hand: Studies in numerical cognition.  Psychology \& Counseling Department Seminar, Tarleton State University.Math
\item Faulkenberry, T. J. (April, 2013). Estimating the working memory requirements of mental arithmetic. Mathematics Education Seminar, University of Texas - Arlington, Arlington, TX.
\item Faulkenberry, T. J. (April, 2012). Reconsidering the magic number 7: Measuring and modeling working memory capacity. Mathematics Department Colloquium, Southeastern Oklahoma State University, Durant, OK.
\item Faulkenberry, T. J. (May, 2012). Arctangent approximations of \(\pi\). Math Club Invited Speaker, Texas A\&M University - Commerce
\item Faulkenberry, T. J. (Feb, 2012). Reconsidering the magic number 7: Measuring and modeling working memory capacity. Mathematics Department Colloquium, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2011). Introduction to \LaTeX{}, Mathematics Department Colloquium, Texas A\&M University - Commerce
\item Faulkenberry, T. J. (2009). Working memory in mathematical cognition: The case for fractions. Mathematics Department Colloquium, Texas A\& M University - Commerce.
\item Faulkenberry, T. J. (2007). Uses, mis-uses, and non-uses of probability and statistics. Math club invited lecture, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2006). Continuous dynamics among phonological competitors. Cognitive Science Seminar, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2006). The evolution of color language. Cognitive Science Seminar, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2006). A computational model of event segmentation based on perceptual prediction. Cognitive Science Seminar, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2006). An introduction to latent semantic analysis. Cognitive Science Seminar, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2006). Dissections in mathematics. Math club invited lecture, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2006). Embodied cognition: The role of body and mind in abstract thought. Mathematics Education Seminar, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2005). A cognitive map for mathematical induction. Mathematics Education Seminar, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2005). Reflective abstraction in advanced mathematical thinking. Mathematics Education Seminar, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2005). Explorations in Flatland. Mathematics Colloquium, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2005). What is mathematics education research? Mathematics Education Seminar, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2004). Where do all the knots live: Templates and surface dynamics. Mathematics Colloquium, Texas A\&M University - Commerce.
\item Faulkenberry, T. J. (2003). A beginner’s guide to 3-manifolds. Graduate Student Colloquium, University of North Texas.
\item Faulkenberry, T. J. (2002). Determining the shape of space. Mathematics Colloquium, University of Central Oklahoma.
\item Faulkenberry, T. J. (2002). Determining the shape of space. Mathematics Colloquium, East Central University.
\item Faulkenberry, T. J. (2002). Algorithms in topology. Mathematics Colloquium, Southeastern Oklahoma State University.
\end{enumerate}
