research/vita.org
** Research Funding  

/PI unless otherwise noted.  Total funding = $263,331./

- 2019 (summer), National Science Foundation / Mathematical Association of America, National Research Experiences for Undergraduates Program (NREUP), $29,663. /CMAT: Computational Mathematics at Tarleton/
- 2018-2019, Tarleton State University, Faculty-Student Research Grant, $5000, /Modeling individual difference structures in numerical cognition/
- 2018 (spring), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, /Using hierarchical Bayesian modeling to uncover the cognitive mechanisms underlying associations between number and space/
- 2017 (fall), Tarleton State University, Faculty Development Grant, $1000, /Travel: Psychonomic Society Meeting in Vancouver, BC/
- 2017 (summer), Tarleton State University, First Year Research Experience (FYRE), $4000, /Using the Wiener diffusion process to model response time distributions in a numerical decision task/  
- 2015 (fall), Tarleton State University, Faculty Development Grant, $750, /Travel: Psychonomic Society Meeting in Boston, MA/
- 2016 (summer), Tarleton State University, First Year Research Experience (FYRE), $6500, /Investigating the dynamics of operator preview effects in mental arithmetic/
- 2016 (summer), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $4000, /Testing competing models of two-digit number representation: Decomposed, holistic, or hybrid?/
- 2016 (spring), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, /Testing decomposed versus holistic fraction representations via an implicit priming task/
- 2016 (spring), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, /Is memory "retrieval" in single digit arithmetic really just rapid shifts of attention along a mental number line?/
- 2015 (fall), Tarleton State University, Faculty Development Grant, $750, /Travel: Psychonomic Society Meeting in Chicago, Illinois/
- 2015 (fall), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, /The effects of numerical fluency on mental representations of two-digit numbers./
- 2015 (fall), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, /Spatial-numerical associations in mental arithmetic./
- 2015 (summer), Tarleton State University, First Year Research Experience (FYRE), $6500, /Mental representations of two-digit numbers/
- 2015 (summer), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $3500, /Spatial-numerical associations in mental arithmetic./
- 2015 (spring), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, /Are the stages of cognitive arithmetic additive or interactive? The effects of numerical surface form on an addition production task./
- 2015 (spring), Society for the Teaching of Psychology, Early Career Travel Grant, $350, /Travel: Southwestern Teachers of Psychology Conference in Wichita, Kansas/
- 2014-2015, Tarleton State University, Organized Research Grant, $9560, /Investigating the cognitive factors behind mathematics learning disability/
- 2014 (fall), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, /The effects of numerical surface form on strategies for mental arithmetic verification/
- 2014 (fall), Tarleton State University, Faculty Development Grant, $508, /Travel: Psychonomic Society Meeting in Long Beach, California/
- 2014 (summer), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $3500, /Using hand tracking to analyze mental representations of fractions/
- 2014 (spring), Tarleton State University, QEP Startup Grant, $1500, /Applied Learning Experience: Undergraduate Research in Mathematical Cognition/
- 2013 (fall), Tarleton State University, Faculty Development Grant, $630, /Travel: Psychonomic Society Meeting in Toronto, Ontario/
- 2012-2013, National Science Foundation: Robert Noyce Scholarship Program, $174,020 (Co-PI with Ben Jang), /Building the Capacity for Math and Science Teacher Training/
- 2010, Texas A&M University – Commerce, OSP Research Grant, $5000, /Mouse Tracking in Mathematical Cognition/
- 2008, Texas A&M University – Commerce, OSP Mini Grant, $600, /IoLab Button Box for Psyscope X/
  
** Editorial roles
- Associate Editor (2019-present): /Journal of Numerical Cognition/
- Associate Editor (2017-present): /Journal of European Psychology Students/
- Associate Editor (2016-present): /Journal of Psychological Inquiry/
- Guest Editor (2016-2018): /Journal of Numerical Cognition/
- Associate Editor (2017-2019): /Frontiers in Psychology: Cognition Section/
- Review Editor (2016-2017): /Frontiers in Psychology: Cognition Section/
** Reviewing
   
- Ad hoc reviewer for the following journals: /Acta Psychologica, Attention, Perception, & Psychophysics, Behavior Research Methods, British Journal of Developmental Psychology, Canadian Journal of Experimental Psychology, Cognitive Processing, Cognition, Cognitive Science, Frontiers in Psychology, Journal of Cognitive Psychology, Journal of Experimental Child Psychology, Journal of Numerical Cognition, Learning and Individual Differences, Mathematics Teacher, Mathematics Teaching in the Middle School, Meta-Psychology, Proceedings of the Research Council on Mathematics Learning, Psychological Methods, Psychonomic Bulletin and Review, Quarterly Journal of Experimental Psychology/
- External Examiner
  - 2017, Corinna Jones, Ph.D., University of Huddersfield, UK
- Panelist/Reader
  - 2017-2019, Judge, American Statistical Association Statistics Project Competition
  - 2015-2020, Reader, AP Statistics Exam, Kansas City, MO
  - 2012-2015, Panelist, National Science Foundation, Washington, DC
 
- Textbook reviewer for Psychology Press, Routledge, Sage, Taylor & Francis, Cambridge Univ. Press
    
** Professional Memberships 
- American Mathematical Society
- American Statistical Association
- Mathematical Association of America
- Mathematical Cognition and Learning Society
- Psychonomic Society
- Society for Mathematical Psychology
- Southwestern Psychological Association (SWPA)

