research/vita.tex

\subsection*{Research Funding}
\label{sec:org2f1c9aa}

\emph{PI unless otherwise noted.  Total funding = \$263,331.}

\begin{itemize}
\item 2019 (summer), National Science Foundation / Mathematical Association of America, National Research Experiences for Undergraduates Program (NREUP), \$29,663. \emph{CMAT: Computational Mathematics at Tarleton}
\item 2018-2019, Tarleton State University, Faculty-Student Research Grant, \$5000, \emph{Modeling individual difference structures in numerical cognition}
\item 2018 (spring), Tarleton State University, OSRCA Undergrad. Res. Assistantship, \$1000, \emph{Using hierarchical Bayesian modeling to uncover the cognitive mechanisms underlying associations between number and space}
\item 2017 (fall), Tarleton State University, Faculty Development Grant, \$1000, \emph{Travel: Psychonomic Society Meeting in Vancouver, BC}
\item 2017 (summer), Tarleton State University, First Year Research Experience (FYRE), \$4000, \emph{Using the Wiener diffusion process to model response time distributions in a numerical decision task}
\item 2015 (fall), Tarleton State University, Faculty Development Grant, \$750, \emph{Travel: Psychonomic Society Meeting in Boston, MA}
\item 2016 (summer), Tarleton State University, First Year Research Experience (FYRE), \$6500, \emph{Investigating the dynamics of operator preview effects in mental arithmetic}
\item 2016 (summer), Tarleton State University, OSRCA Undergrad. Res. Assistantship, \$4000, \emph{Testing competing models of two-digit number representation: Decomposed, holistic, or hybrid?}
\item 2016 (spring), Tarleton State University, OSRCA Undergrad. Res. Assistantship, \$1000, \emph{Testing decomposed versus holistic fraction representations via an implicit priming task}
\item 2016 (spring), Tarleton State University, OSRCA Undergrad. Res. Assistantship, \$1000, \emph{Is memory "retrieval" in single digit arithmetic really just rapid shifts of attention along a mental number line?}
\item 2015 (fall), Tarleton State University, Faculty Development Grant, \$750, \emph{Travel: Psychonomic Society Meeting in Chicago, Illinois}
\item 2015 (fall), Tarleton State University, OSRCA Undergrad. Res. Assistantship, \$1000, \emph{The effects of numerical fluency on mental representations of two-digit numbers.}
\item 2015 (fall), Tarleton State University, OSRCA Undergrad. Res. Assistantship, \$1000, \emph{Spatial-numerical associations in mental arithmetic.}
\item 2015 (summer), Tarleton State University, First Year Research Experience (FYRE), \$6500, \emph{Mental representations of two-digit numbers}
\item 2015 (summer), Tarleton State University, OSRCA Undergrad. Res. Assistantship, \$3500, \emph{Spatial-numerical associations in mental arithmetic.}
\item 2015 (spring), Tarleton State University, OSRCA Undergrad. Res. Assistantship, \$1000, \emph{Are the stages of cognitive arithmetic additive or interactive? The effects of numerical surface form on an addition production task.}
\item 2015 (spring), Society for the Teaching of Psychology, Early Career Travel Grant, \$350, \emph{Travel: Southwestern Teachers of Psychology Conference in Wichita, Kansas}
\item 2014-2015, Tarleton State University, Organized Research Grant, \$9560, \emph{Investigating the cognitive factors behind mathematics learning disability}
\item 2014 (fall), Tarleton State University, OSRCA Undergrad. Res. Assistantship, \$1000, \emph{The effects of numerical surface form on strategies for mental arithmetic verification}
\item 2014 (fall), Tarleton State University, Faculty Development Grant, \$508, \emph{Travel: Psychonomic Society Meeting in Long Beach, California}
\item 2014 (summer), Tarleton State University, OSRCA Undergrad. Res. Assistantship, \$3500, \emph{Using hand tracking to analyze mental representations of fractions}
\item 2014 (spring), Tarleton State University, QEP Startup Grant, \$1500, \emph{Applied Learning Experience: Undergraduate Research in Mathematical Cognition}
\item 2013 (fall), Tarleton State University, Faculty Development Grant, \$630, \emph{Travel: Psychonomic Society Meeting in Toronto, Ontario}
\item 2012-2013, National Science Foundation: Robert Noyce Scholarship Program, \$174,020 (Co-PI with Ben Jang), \emph{Building the Capacity for Math and Science Teacher Training}
\item 2010, Texas A\&M University – Commerce, OSP Research Grant, \$5000, \emph{Mouse Tracking in Mathematical Cognition}
\item 2008, Texas A\&M University – Commerce, OSP Mini Grant, \$600, \emph{IoLab Button Box for Psyscope X}
\end{itemize}

\subsection*{Editorial roles}
\label{sec:org533b85d}
\begin{itemize}
\item Associate Editor (2019-present): \emph{Journal of Numerical Cognition}
\item Associate Editor (2017-present): \emph{Journal of European Psychology Students}
\item Associate Editor (2016-present): \emph{Journal of Psychological Inquiry}
\item Guest Editor (2016-2018): \emph{Journal of Numerical Cognition}
\item Associate Editor (2017-2019): \emph{Frontiers in Psychology: Cognition Section}
\item Review Editor (2016-2017): \emph{Frontiers in Psychology: Cognition Section}
\end{itemize}
\subsection*{Reviewing}
\label{sec:orgfa3fbaf}

\begin{itemize}
\item Ad hoc reviewer for the following journals: \emph{Acta Psychologica, Attention, Perception, \& Psychophysics, Behavior Research Methods, British Journal of Developmental Psychology, Canadian Journal of Experimental Psychology, Cognitive Processing, Cognition, Cognitive Science, Frontiers in Psychology, Journal of Cognitive Psychology, Journal of Experimental Child Psychology, Journal of Numerical Cognition, Learning and Individual Differences, Mathematics Teacher, Mathematics Teaching in the Middle School, Meta-Psychology, Proceedings of the Research Council on Mathematics Learning, Psychological Methods, Psychonomic Bulletin and Review, Quarterly Journal of Experimental Psychology}
\item External Examiner
\begin{itemize}
\item 2017, Corinna Jones, Ph.D., University of Huddersfield, UK
\end{itemize}
\item Panelist/Reader
\begin{itemize}
\item 2017-2019, Judge, American Statistical Association Statistics Project Competition
\item 2015-2018, Reader, AP Statistics Exam, Kansas City, MO
\item 2012-2015, Panelist, National Science Foundation, Washington, DC
\end{itemize}

\item Textbook reviewer for Psychology Press, Routledge, Sage, Taylor \& Francis
\end{itemize}

\subsection*{Professional Memberships}
\label{sec:org86d6966}
\begin{itemize}
\item American Mathematical Society
\item American Statistical Association
\item Mathematical Association of America
\item Mathematical Cognition and Learning Society
\item Psychonomic Society
\item Society for Mathematical Psychology
\item Southwestern Psychological Association (SWPA)
\end{itemize}
