research/vita.org
** Professional Service

National/regional service 

- Secretary/Treasurer, MAA Special Interest Group (SIGMAA) on Statistics Education (elected 2020-2022)
- ASA-MAA Joint Committee on Statistics Education (appointed 2020-2023)
- Treasurer, Southwestern Psychological Association (appointed, 2017-2023)	
- Program Review Committee member, Psychonomic Society (appointed 2018-2021)
- Texas Representative, Southwestern Psychological Association (elected, 2015-2017)
- Steering Committee Member, Southwestern Teachers of Psychology (appointed, 2015-2016)
- Nominating Committee Chair, Southwestern Psychological Association (appointed, 2015)
- Advisory Board Member, Collaborative Replications and Education Project (CREP) (appointed, 2014-2016)
- Session Chair, Psychonomics Annual Meeting (2014, 2015)
- Session Chair, Southwestern Psychological Association Meeting (2015)
- Conference Committee Member, Research Council on Mathematics Learning (elected, 2012-2015)
	
University service

- Chair, Institutional Review Board (IRB) (2018-present)
- Member, General Education and Academic Assessment Committee (2019-present)
- Faculty Research Fellow (2018-2019)
- Official Advisor for Alpha Chi Honor Society, Tarleton (2015-present)
- State Non-Funded Course Review Group, Member, Tarleton (2015-present)
- University Research Committee, Member, Tarleton (2015-present)
- Student Research and Creative Activity Advisory Committee, Member, Tarleton (2013-present)
- Member, Institutional Review Board (IRB) (2017-2018)
- Faculty Fellow, Tarleton (2016-2018)
- Honors Advisory Committee for College of Education, Member, Tarleton (2015-2017)
- Session Chair and Judge, TAMUS Pathways Symposium (2017)
- University ALE Task Force, Member, Tarleton (2016-2017)
- Curriculum Committee, College of Education, Member, Tarleton (2014-2017)
- Greater Expectations Task Force, Member, Tarleton (2014-2015)
- Student Marshall, College of Education Commencement, Tarleton (Sp14, Sp15, Fa15)
- Session Chair and Judge, Tarleton Research Symposium (2014, 2015)
- External Search Committee member, Department of Engineering, TAMU-C (2012-2013)
- University Honors Council, Member, TAMU-C (2012-2013)
- Liberal Studies Committee, Member, TAMU-C (2012-2013)
- Developmental Appeals Committee, Member, TAMU-C (2010-2012)		

Department service

- Human subjects research pool coordinator, Tarleton (2018-present)
- Organized /Psychological Sciences Day/, Tarleton (2017-present)
- Search Committee Chair, Department of Psychological Sciences, Tarleton (2014, 2015, 2020)
- Texan Orientation, Department of Psychological Sciences, Tarleton (2014-2018)
- Texan Tour Speaker, Department of Psychological Sciences, Tarleton (2015)
- Organizer, Psychology Department Seminar, Tarleton (2013-2014)
- Psychology Scholarship Committee, Tarleton (2013-2015)
- Psychology Undergraduate Programs Committee, Member, TAMU-C (2011-2012)
  
** Courses Taught

Tarleton State University

- PSYC 2301: General Psychology (Honors), Fall 13,14,15
- PSYC 2317: Statistical Methods for Psychology, Fall 19, Sp 20
- PSYC 2301: General Psychology, Summer 14,15
- PSYC 3301: Psychology of Learning, Fall 13,14,15,16
- PSYC 3303: Educational Psychology, Fall 13; Spring 14; Summer 14,15,16
- PSYC 3309: Writing in Psychology, Spring 16
- PSYC 3320: Psycholinguistics, Summer 17,18,19,20
- PSYC 3330: Elem Statistics for Behav Science, Fall 14,15,16,17,18; Sp 15,16,17,18; Su 16,17,18
- PSYC 3435: Prin Research for Behav Science, Fall 14,15,16,17,18,19; Sp 15,16,17,18,19; Su 15,16,17
- PSYC 4301: Psychological Tests and Measurements, Sp 20
- PSYC 4386: Advanced Statistical Methods, Spring 14
- PSYC 4386: Methods in Experimental Psychology, Spring 15; Fall 15
- PSYC 4386: Problems in Numerical Cognition, Fall 15
- PSYC 5303: Theories of Learning, Fall 16
- HONS 3385: Honors Seminar (Numerical Cognition), Spring 15
- PSYC 5301: Research Methods, Spring 14,15,17,18,19
- PSYC 5304: Human Development, Spring 14
- PSYC 5316: Advanced Quantitative Methods, Fall 17,18,19
- PSYC 5322: Psychometrics, Sp 20
- PSYC 5379: Advanced Psycholinguistics, Summer 17,18,19,20
- EDAD 6313: Statistical Methods for Educational Leadership, Spring 16

** Student Mentoring
*** Masters Thesis Chair
- Kristen Bowman (Applied Psychology, Tarleton, graduated 2020)
- Chelsea Bradley (Applied Psychology, Tarleton, graduated 2018)

*** Doctoral Committees

- Jeni McNeely (Educational Leadership, Tarleton, graduated 2016)
- Trina Geye (Psychology, TAMU-C, graduated 2016)
- Stephen McDaniel (Psychology, TAMU-C, in progress)
- Beth Nikopoulous (Psychology, TAMU-C, graduated 2015)
- Donna Peters (Psychology, TAMU-C, graduated 2013)
	
*** Masters Committees

- Kayli Colpitts (Applied Psychology, Tarleton, in progress)
- Kody Lamb (Applied Psychology, Tarleton, graduated 2018)
- Trina Geye (Psychology, TAMU-C, graduated 2015)
- Beth Nikopoulous (Psychology, TAMU-C, graduated 2013)
- Heather Oetker (Special Education, TAMU-C, graduated 2012)
- Joshua Patterson (Mathematics, TAMU-C, graduated 2011)

*** Honors Thesis Chair

- Kristen Bowman (Psychology, Tarleton, graduated 2018), /Nonwords induce reverse priming effects in a lexical decision task/
- Anissa Eid (Psychology, Tarleton, graduated 2018), /Cognitive mechanisms underlying spatial-numerical associations/
- Paige Woodard (Psychology, Tarleton, graduated 2017), /Mental arithmetic: Relationship between encoding and calculation processes/
- Sarah Montgomery (High Honors in Psychology, TAMU-C, graduated 2013), /Measuring the Working Memory Requirements of Mental Arithmetic/
- Emily Dalton (Honors in Psychology, TAMU-C, graduated 2013), /The Effects of Generation on False Memory for Numbers/
- Kaytlin Reid (Honors in Interdisciplinary Studies, TAMU-C, graduated 2013), /The Role of Working Memory in Mental Fraction Computation/
- Douglas Boney (Honors in Mathematics, TAMU-C, graduated 2013), /Knot Polynomials/
- Samantha Reece (Honors in Sociology, TAMU-C, graduated 2012), /The Effects of Stereotype Threat on Cheating Behavior in Mathematics/

*** Honors Thesis Committees

- Carmen Phelps (English, TAMU-C, 2013)
- Morgan Lutz (Psychology, TAMU-C, 2013)
- Nick Bredberg (Physics, TAMU-C, 2012)
- Kallie Hinton (Mathematics Education, TAMU-C, 2011)
- Lindsey Preston (Mathematics Education, TAMU-C, 2011)

  
