research/vita.tex

\subsection*{Professional Service}
\label{sec:orgcf46437}

National/regional service 

\begin{itemize}
\item Secretary/Treasurer, MAA Special Interest Group (SIGMAA) on Statistics Education (elected 2020-2022)
\item ASA-MAA Joint Committee on Statistics Education (appointed 2020-2023)
\item Treasurer, Southwestern Psychological Association (appointed, 2017-2023)
\item Program Review Committee member, Psychonomic Society (appointed 2018-2021)
\item Texas Representative, Southwestern Psychological Association (elected, 2015-2017)
\item Steering Committee Member, Southwestern Teachers of Psychology (appointed, 2015-2016)
\item Nominating Committee Chair, Southwestern Psychological Association (appointed, 2015)
\item Advisory Board Member, Collaborative Replications and Education Project (CREP) (appointed, 2014-2016)
\item Session Chair, Psychonomics Annual Meeting (2014, 2015)
\item Session Chair, Southwestern Psychological Association Meeting (2015)
\item Conference Committee Member, Research Council on Mathematics Learning (elected, 2012-2015)
\end{itemize}

University service

\begin{itemize}
\item Chair, Institutional Review Board (IRB) (2018-present)
\item Faculty Research Fellow (2018-2019)
\item Official Advisor for Alpha Chi Honor Society, Tarleton (2015-present)
\item State Non-Funded Course Review Group, Member, Tarleton (2015-present)
\item University Research Committee, Member, Tarleton (2015-present)
\item Student Research and Creative Activity Advisory Committee, Member, Tarleton (2013-present)
\item Member, Institutional Review Board (IRB) (2017-2018)
\item Faculty Fellow, Tarleton (2016-2018)
\item Honors Advisory Committee for College of Education, Member, Tarleton (2015-2017)
\item Session Chair and Judge, TAMUS Pathways Symposium (2017)
\item University ALE Task Force, Member, Tarleton (2016-2017)
\item Curriculum Committee, College of Education, Member, Tarleton (2014-2017)
\item Greater Expectations Task Force, Member, Tarleton (2014-2015)
\item Student Marshall, College of Education Commencement, Tarleton (Sp14, Sp15, Fa15)
\item Session Chair and Judge, Tarleton Research Symposium (2014, 2015)
\item External Search Committee member, Department of Engineering, TAMU-C (2012-2013)
\item University Honors Council, Member, TAMU-C (2012-2013)
\item Liberal Studies Committee, Member, TAMU-C (2012-2013)
\item Developmental Appeals Committee, Member, TAMU-C (2010-2012)
\end{itemize}

Department service

\begin{itemize}
\item Organized \emph{Psychological Sciences Day}, Tarleton, (2017-2018)
\item Search Committee Chair, Department of Psychological Sciences, Tarleton (2014, 2015)
\item Texan Orientation, Department of Psychological Sciences, Tarleton (2014-2018)
\item Texan Tour Speaker, Department of Psychological Sciences, Tarleton (2015)
\item Organizer, Psychology Department Seminar, Tarleton (2013-2014)
\item Psychology Scholarship Committee, Tarleton (2013-2015)
\item Psychology Undergraduate Programs Committee, Member, TAMU-C (2011-2012)
\end{itemize}

\subsection*{Courses Taught}
\label{sec:orgec4207c}

Tarleton State University

\begin{itemize}
\item PSYC 2301: General Psychology (Honors), Fall 13,14,15
\item PSYC 2317: Statistical Methods for Psychology, Fall 19, Sp 20
\item PSYC 2301: General Psychology, Summer 14,15
\item PSYC 3301: Psychology of Learning, Fall 13,14,15,16
\item PSYC 3303: Educational Psychology, Fall 13; Spring 14; Summer 14,15,16
\item PSYC 3309: Writing in Psychology, Spring 16
\item PSYC 3320: Psycholinguistics, Summer 17,18,19,20
\item PSYC 3330: Elem Statistics for Behav Science, Fall 14,15,16,17,18; Sp 15,16,17,18; Su 16,17,18
\item PSYC 3435: Prin Research for Behav Science, Fall 14,15,16,17,18,19; Sp 15,16,17,18,19; Su 15,16,17
\item PSYC 4301: Psychological Tests and Measurements, Sp 20
\item PSYC 4386: Advanced Statistical Methods, Spring 14
\item PSYC 4386: Methods in Experimental Psychology, Spring 15; Fall 15
\item PSYC 4386: Problems in Numerical Cognition, Fall 15
\item PSYC 5303: Theories of Learning, Fall 16
\item HONS 3385: Honors Seminar (Numerical Cognition), Spring 15
\item PSYC 5301: Research Methods, Spring 14,15,17,18,19
\item PSYC 5304: Human Development, Spring 14
\item PSYC 5316: Advanced Quantitative Methods, Fall 17,18,19
\item PSYC 5322: Psychometrics, Sp 20
\item PSYC 5379: Advanced Psycholinguistics, Summer 17,18,19,20
\item EDAD 6313: Statistical Methods for Educational Leadership, Spring 16
\end{itemize}

\subsection*{Student Mentoring}
\label{sec:org148c0b2}

\subsubsection*{Masters Thesis Chair}
\label{sec:orga4c0ef2}
\begin{itemize}
\item Kristen Bowman (Applied Psychology, Tarleton, graduated 2020)
\item Chelsea Bradley (Applied Psychology, Tarleton, graduated 2018)
\end{itemize}

\subsubsection*{Doctoral Committees}
\label{sec:org1ab2003}

\begin{itemize}
\item Jeni McNeely (Educational Leadership, Tarleton, graduated 2016)
\item Trina Geye (Psychology, TAMU-C, graduated 2016)
\item Stephen McDaniel (Psychology, TAMU-C, in progress)
\item Beth Nikopoulous (Psychology, TAMU-C, graduated 2015)
\item Donna Peters (Psychology, TAMU-C, graduated 2013)
\end{itemize}

\subsubsection*{Masters Committees}
\label{sec:org8075973}

\begin{itemize}
\item Kayli Colpitts (Applied Psychology, Tarleton, in progress)
\item Kody Lamb (Applied Psychology, Tarleton, graduated 2018)
\item Trina Geye (Psychology, TAMU-C, graduated 2015)
\item Beth Nikopoulous (Psychology, TAMU-C, graduated 2013)
\item Heather Oetker (Special Education, TAMU-C, graduated 2012)
\item Joshua Patterson (Mathematics, TAMU-C, graduated 2011)
\end{itemize}

\subsubsection*{Honors Thesis Chair}
\label{sec:org061ddb3}

\begin{itemize}
\item Kristen Bowman (Psychology, Tarleton, graduated 2018), \emph{Nonwords induce reverse priming effects in a lexical decision task}
\item Anissa Eid (Psychology, Tarleton, graduated 2018), \emph{Cognitive mechanisms underlying spatial-numerical associations}
\item Paige Woodard (Psychology, Tarleton, graduated 2017), \emph{Mental arithmetic: Relationship between encoding and calculation processes}
\item Sarah Montgomery (High Honors in Psychology, TAMU-C, graduated 2013), \emph{Measuring the Working Memory Requirements of Mental Arithmetic}
\item Emily Dalton (Honors in Psychology, TAMU-C, graduated 2013), \emph{The Effects of Generation on False Memory for Numbers}
\item Kaytlin Reid (Honors in Interdisciplinary Studies, TAMU-C, graduated 2013), \emph{The Role of Working Memory in Mental Fraction Computation}
\item Douglas Boney (Honors in Mathematics, TAMU-C, graduated 2013), \emph{Knot Polynomials}
\item Samantha Reece (Honors in Sociology, TAMU-C, graduated 2012), \emph{The Effects of Stereotype Threat on Cheating Behavior in Mathematics}
\end{itemize}

\subsubsection*{Honors Thesis Committees}
\label{sec:org67faae8}

\begin{itemize}
\item Carmen Phelps (English, TAMU-C, 2013)
\item Morgan Lutz (Psychology, TAMU-C, 2013)
\item Nick Bredberg (Physics, TAMU-C, 2012)
\item Kallie Hinton (Mathematics Education, TAMU-C, 2011)
\item Lindsey Preston (Mathematics Education, TAMU-C, 2011)
\end{itemize}
\end{document}